Repository: rock4on/PATTERNX
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ro

source: Dashboard
ro: Panou de control

source: Surveys
ro: Sondaje

source: Rewards
ro: Recompense

source: My Rewards
ro: Recompensele mele

source: Users
ro: Utilizatori

source: points
ro: puncte

source: Logout
ro: Deconectare

source: Login
ro: Autentificare

source: Register
ro: Înregistrare

source: Privacy Policy
ro: Politica de confidențialitate

source: Terms of Service
ro: Termeni și condiții

source: Don't have an account?
ro: Nu ai un cont?

source: Register here
ro: Înregistrează-te aici

source: Already have an account?
ro: Ai deja un cont?

source: Login here
ro: Autentifică-te aici

source: Welcome to Survey Platform
ro: Bun venit pe platforma de sondaje

source: Take Surveys, Earn Rewards
ro: Completează sondaje, câștigă recompense

source: Join our platform to complete surveys and earn points that can be redeemed for amazing rewards.
ro: Alătură-te platformei noastre pentru a completa sondaje și a câștiga puncte care pot fi răscumpărate pentru recompense uimitoare.

source: Available Surveys
ro: Sondaje disponibile

source: Get Started
ro: Începe

source: Complete Surveys
ro: Completează sondaje

source: Browse and complete available surveys on topics that matter to you.
ro: Răsfoiește și completează sondajele disponibile pe subiecte care te interesează.

source: Earn Points
ro: Câștigă puncte

source: Get rewarded with points for every survey you complete successfully.
ro: Fii recompensat cu puncte pentru fiecare sondaj completat cu succes.

source: Redeem Rewards
ro: Răscumpără recompense

source: Exchange your earned points for exciting rewards and benefits.
ro: Schimbă punctele câștigate pentru recompense și beneficii interesante.

source: Survey Platform - Home
ro: Platforma de sondaje - Acasă

source: Sign Up
ro: Înregistrare

source: Log In
ro: Autentificare

source: Platform Statistics
ro: Statistici platformă

source: Active Surveys
ro: Sondaje active

source: Registered Users
ro: Utilizatori înregistrați

source: Surveys Completed
ro: Sondaje completate

source: Reward
ro: Recompensă

source: Your Available Points
ro: Punctele tale disponibile

source: Description
ro: Descriere

source: Limited availability
ro: Disponibilitate limitată

source: Only
ro: Doar

source: left
ro: rămase

source: Redemption Instructions
ro: Instrucțiuni de răscumpărare

source: Verify you have enough points
ro: Verifică dacă ai suficiente puncte

source: required
ro: necesar

source: Click the "Redeem Now" button below.
ro: Apasă butonul „Răscumpără acum” de mai jos.

source: Confirm your redemption.
ro: Confirmă răscumpărarea.

source: Your reward status will be updated in "My Rewards" section.
ro: Starea recompensei tale va fi actualizată în secțiunea „Recompensele mele”.

source: Redeem Now
ro: Răscumpără acum

source: Not Enough Points
ro: Nu ai suficiente puncte

source: Earn More Points
ro: Câștigă mai multe puncte

source: Confirm Redemption
ro: Confirmă răscumpărarea

source: You are about to redeem this reward for
ro: Ești pe cale să răscumperi această recompensă pentru

source: Your current points
ro: Punctele tale actuale

source: After redemption
ro: După răscumpărare

source: Cancel
ro: Anulează

source: Available Rewards
ro: Recompense disponibile

source: Your Points
ro: Punctele tale

source: Redeem your points for these exciting rewards.
ro: Răscumpără-ți punctele pentru aceste recompense interesante.

source: Redeem
ro: Răscumpără

source: No rewards available right now
ro: Momentan nu sunt recompense disponibile

source: Check back later for new reward opportunities.
ro: Verifică mai târziu pentru noi oportunități de recompensare.

source: Return to Dashboard
ro: Înapoi la panoul de control

source: Available Points
ro: Puncte disponibile

source: Track the status of your redeemed rewards.
ro: Urmărește starea recompenselor răscumpărate.

source: Redemption History
ro: Istoricul răscumpărărilor

source: Date
ro: Data

source: Points Spent
ro: Puncte cheltuite

source: Status
ro: Stare

source: Pending
ro: În așteptare

source: Completed
ro: Finalizat

source: Cancelled
ro: Anulat

source: No rewards redeemed yet
ro: Încă nu ai răscumpărat recompense

source: You haven't redeemed any rewards yet.
ro: Nu ai răscumpărat încă nicio recompensă.

source: Browse Rewards
ro: Răsfoiește recompense

source: Status Information
ro: Informații despre stare

source: What it means
ro: Ce înseamnă

source: Your redemption is being processed. Please allow some time for our team to fulfill your request.
ro: Răscumpărarea ta este în curs de procesare. Te rugăm să acorzi ceva timp echipei noastre pentru a îndeplini cererea ta.

source: Your reward has been delivered or is ready for pickup. Check your email for further instructions.
ro: Recompensa ta a fost livrată sau este gata de ridicare. Verifică e-mailul pentru instrucțiuni suplimentare.

source: The redemption was cancelled. This could be due to unavailability or issues with the redemption.
ro: Răscumpărarea a fost anulată. Aceasta se poate datora indisponibilității sau problemelor cu răscumpărarea.

source: Survey
ro: Sondaj

source: About this survey
ro: Despre acest sondaj

source: Available until
ro: Disponibil până la

source: Estimated time
ro: Timp estimat

source: minutes
ro: minute

source: Instructions
ro: Instrucțiuni

source: Click the "Start Survey" button below to open the survey.
ro: Apasă butonul „Începe sondajul” de mai jos pentru a deschide sondajul.

source: Complete all questions in the survey.
ro: Completează toate întrebările din sondaj.

source: Submit your responses at the end of the survey.
ro: Trimite răspunsurile la finalul sondajului.

source: Return to this page and click "Mark as Completed" to earn your points.
ro: Revenind la această pagină și apasă „Marchează ca finalizat” pentru a câștiga punctele.

source: Your responses are important to us. Please answer all questions honestly and completely.
ro: Răspunsurile tale sunt importante pentru noi. Te rugăm să răspunzi la toate întrebările sincer și complet.

source: Start Survey
ro: Începe sondajul

source: Mark as Completed
ro: Marchează ca finalizat

source: Confirm Survey Completion
ro: Confirmă finalizarea sondajului

source: To confirm that you've completed the survey, please click on this button.
ro: Pentru a confirma că ai completat sondajul, te rugăm să apeși acest buton.

source: Make sure that all the questions are finished
ro: Asigură-te că toate întrebările sunt finalizate

source: Confirm Completion
ro: Confirmă finalizarea

source: Complete surveys to earn points and redeem rewards.
ro: Completează sondaje pentru a câștiga puncte și a răscumpăra recompense.

source: Always available
ro: Întotdeauna disponibil

source: Take Survey
ro: Completează sondajul

source: No surveys available right now
ro: Momentan nu sunt sondaje disponibile

source: Check back later for new survey opportunities.
ro: Verifică mai târziu pentru noi oportunități de sondare.
